API_TOKEN = '6430227260:AAEJ1OK5h3m_EWXodFARn59UmQny_1niat4'

TEXT_FOR_TERM = """
    Терминология:\n
    1⃣<b>Личный бюджет —</b> совокупность всех доходов и расходов за определенный период времени.\n
    2⃣<b>Дефицит бюджета —</b> ситуация, когда расходы превышают доходы.\n
    3⃣<b>Профицит бюджета —</b> обратная ситуация, когда доходы превышают расходы.\n
    4⃣<b>Сбережения —</b> часть дохода, которая остается после оплаты всех необходимых расходов и может быть использована для накопления или инвестирования.\n
    5⃣<b>Инвестиции —</b> вложение денег в различные активы с целью получения дохода или увеличения стоимости вложений в будущем.\n
    6⃣<b>Кредит —</b> сумма денег, которую заемщик берет у кредитора на определенных условиях (например, с обязательством вернуть деньги с процентами).\n
    7⃣<b>Ставка процента —</b> плата, которую кредитор взимает за предоставление денег в долг.\n
    8⃣<b>Ставка дисконтирования —</b> ставка, по которой будущие доходы от инвестиций приводятся к текущему моменту времени для оценки их стоимости.\n
    9⃣<b>Риск —</b> вероятность того, что инвестиция не принесет ожидаемого дохода или приведет к убыткам.\n
    🔟<b>Ликвидность —</b> способность актива быть быстро проданным по цене, близкой к рыночной.
    """

TEXT_FOR_TERM2 = """
    1⃣<b>Акция —</b> эмиссионная ценная бумага, доля владения компанией, закрепляющая права ее владельца (акционера) на получение части прибыли акционерного общества в виде дивидендов, на участие в управлении акционерным обществом и на часть имущества, остающегося после его ликвидации.\n
    2⃣<b>Банк —</b> коммерческая финансовая организация, основные виды деятельности которой — привлечение и размещение денежных средств, а также проведение расчетов. С экономической точки зрения банки выступают на денежном рынке посредниками между теми, у кого есть свободные денежные средства, и теми, кто нуждается в дополнительных ресурсах. Наиболее распространенные продукты банков — расчетно-кассовое обслуживание физических и юридических лиц, вклады и депозиты, кредиты, в том числе ипотечные займы, автокредиты, потребительские кредиты, банковские карты и др.\n
    3⃣<b>Банковская карта —</b> пластиковая карта, обычно привязанная к одному или нескольким расчетным счетам в банке. Банковские карты используются для безналичных платежей, в том числе и через Интернет, а также для снятия наличных или пополнения счета через банкомат.\n
    4⃣<b>Банковский вклад (банковский депозит) —</b> сумма денег, которую банк принимает от клиента на определенный или неопределенный срок и обязуется возвратить сумму вклада и выплатить проценты на нее на условиях и в порядке, предусмотренных договором. Банки предлагают гражданам вклады до востребования (на неопределенный срок) и срочные депозиты (договором предусмотрен срок, на который банк принимает у вкладчика средства).\n
    5⃣<b>Бюджет семьи —</b> совокупность доходов и расходов семьи за определенный период времени, например, один год или один месяц.\n
    6⃣<b>Вексель —</b> письменное обязательство заемщика (векселедателя) выплатить в установленный срок определенную сумму предъявителю векселя или лицу, указанному в векселе.\n
    7⃣<b>Выплата страховая —</b> осуществление страховщиком выплаты застрахованному лицу страхового возмещения при наступлении страхового случая.\n
    8⃣<b>Пенсия —</b> регулярное (ежемесячное) денежное пособие, выплачиваемое лицам, которые достигли пенсионного возраста (пенсия по старости), имеют инвалидность (пенсия по инвалидности) или потеряли кормильца.\n
    9⃣<b>Денежный перевод —</b> это перевод (движение) денежных средств от отправителя к получателю с помощью операторов платежных систем с целью зачисления денежных средств на счет получателя или выдачи ему их в наличной форме.\n
    🔟<b>Закон спроса и предложения —</b> экономический закон, устанавливающий зависимость величины спроса и предложения товаров на рынке от их цен. При прочих равных условиях, чем цена на товар ниже, тем больше величина спроса (готовность покупать) и тем меньше величина предложения (готовность продавать).
"""

TEXT_FOR_TERM3 = """
    1⃣<b>Заработная плата (оплата труда работника) —</b> вознаграждение за труд в зависимости от квалификации работника, сложности, количества, качества и условий выполняемой работы, а также компенсационные и стимулирующие выплаты.\n
    2⃣<b>Заемщик —</b> лицо, получившее финансовые средства в свое распоряжение для временного их использования.\n
    3⃣<b>Инфляция (обесценивание денег) —</b> увеличение количества денег в обращении, приводящее к повышению общего уровня цен на товары и услуги.\n
    4⃣<b>Кредитор —</b> лицо, предоставляющее в долг финансовые средства.\n
    5⃣<b>Микрокредитование —</b> вид финансирования, заключающийся в выдаче небольших займов на небольшие сроки, как правило, под большие проценты, обычно людям, которые не имеют доступа к традиционным банкам в силу разных причин.\n
    6⃣<b>Спрос —</b> количество товара, который покупатели хотят приобрести за какое-то время (неделя, месяц и т. д.).\n
    7⃣<b>Страхование —</b> финансовая услуга, покрывающая полностью или частично ущерб при наступлении страхового случая.\n
    8⃣<b>Страхование жизни —</b> страхование, предусматривающее защиту имущественных интересов застрахованного лица, связанных с его жизнью и смертью.\n
    9⃣<b>Страховая премия (страховой взнос, страховой платеж) —</b> плата за страхование, которую страхователь обязан внести страховщику в соответствии с договором страхования или законом.\n
    🔟<b>Страхователь —</b> клиент страховой компании, заключающий договор страхования.
"""

TEXT_FOR_TERM4 = """
    1⃣<b>Страховщик (страховая компания) —</b> компания, оказывающая страховые услуги.\n
    2⃣<b>Товар —</b> любая вещь, которая участвует в свободном обмене на другие вещи, или продукт, произведенный для продажи.\n
    3⃣<b>Услуга —</b> результат одного или нескольких действий, осуществленных при взаимодействии поставщика и потребителя (услуги медицинские, образовательные, транспортные, аренда и др.).\n
    4⃣<b>Функция спроса —</b> функция, определяющая спрос в зависимости от влияющих на него различных факторов.\n
    5⃣<b>Штраф —</b> узаконенное наказание за правонарушение в виде определенной суммы денег, обязанность уплаты которой возлагается на нарушителя.\n
    6⃣<b>Предложение —</b> количество товара, которое производители готовы продать.\n
    7⃣<b>Премия (трудовая) —</b> одна из форм поощрения за выдающиеся результаты, достигнутые в какой-либо области деятельности либо поощрительная плата работнику за высокую квалификацию, перевыполнение норм выработки, за качество работы в дополнение к окладу.\n
    8⃣<b>Прибыль —</b> положительная разница между суммарными доходами (в которые входит выручка от реализации товаров и услуг, полученные штрафы и компенсации, процентные доходы и т. п.) и затратами на производство или приобретение, хранение, транспортировку, сбыт этих товаров и услуг. Прибыль = Доходы – Затраты (в денежном выражении).\n
    9⃣<b>Простые проценты —</b> метод расчета процентов, при котором начисления происходят однократно на первоначальную сумму вклада (долга).\n
    🔟<b>Сложные проценты (капитализация процентов) —</b> причисление процентов к сумме вклада, позволяет в дальнейшем осуществлять начисление процентов и на первоначальный вклад, и на пополнение.\n
"""

# config_casino
GAMES = "Игры 💣"
BALANCE = "Ваш баланс 💵"
BALANCE_PAY = "Пополнить баланс 💸"
STOP_GAME = "Остановить игру ❌"
DISCR = "О боте 📱"
HELP = "Помощь 🔍"
BACK = "Вернуться в бота⬅"

DICE_GAME = "Игра в кости 🎲"
GAMES_SLOTS = "Игра в слоты 🎰"
RPS_GAME = "Камень-ножницы-бумага ✂"

ROLL_THE_DICE = "Кинуть кости 🎲"
TWIST = "Крутить слот 🎰"
ROCK = "Камень✊"
PAPER = "Бумага🖐"
SCISSORS = "Ножницы✌"

MAIN_MENU = "Главное меню 🕹"
BACK_TO_GAMES = "Вернуться к списку игр 💣"

HELP_COMMAND = """
<b>/start</b> - <em>Запуск/перезапуск бота</em>
<b>Игры 💣</b> - <em>Меню игр</em>
<b>Ваш баланс 💵</b> - <em>Меню баланса</em>
<b>Помощь 🔍</b> - <em>Все команды</em>
<b>О боте 📱</b> - <em>Описание бота</em>\n
В меню игры вы можете выбрать игру в которую хотите поиграть.
Перед началом каждой игры пишутся правила, которые нужно учитывать.
Приятной игры 👋"""
