# Токен бота
API_TOKEN = '5736133438:AAE68d7TKBPD8OiuC2MO_j_lxCl4SVMPY1s'

GAMES = "Игры 💣"
BALANCE = "Ваш баланс 💵"
BALANCE_PAY = "Пополнить баланс 💸"
STOP_GAME = "Остановить игру ❌"
DISCR = "О боте 📱"
HELP = "Помощь 🔍"

DICE_GAME = "Игра в кости 🎲"
GAMES_SLOTS = "Игра в слоты 🎰"
RPS_GAME = "Камень-ножницы-бумага ✂"

ROLL_THE_DICE = "Кинуть кости 🎲"
TWIST = "Крутить слот 🎰"
ROCK = "Камень✊"
PAPER = "Бумага🖐"
SCISSORS = "Ножницы✌"

MAIN_MENU = "Главное меню 🕹"
BACK_TO_GAMES = "Вернуться к списку игр 💣"

HELP_COMMAND = """
<b>/start</b> - <em>Запуск/перезапуск бота</em>
<b>Игры 💣</b> - <em>Меню игр</em>
<b>Ваш баланс 💵</b> - <em>Меню баланса</em>
<b>Помощь 🔍</b> - <em>Все команды</em>
<b>О боте 📱</b> - <em>Описание бота</em>\n
В меню игры вы можете выбрать игру в которую хотите поиграть.
Перед началом каждой игры пишутся правила, которые нужно учитывать.
Приятной игры 👋"""
