API_TOKEN = '6430227260:AAEJ1OK5h3m_EWXodFARn59UmQny_1niat4'

TEXT_FOR_TERM = """
    Терминология:\n
    1⃣Личный бюджет: совокупность всех доходов и расходов за определенный период времени.\n
    2⃣Дефицит бюджета: ситуация, когда расходы превышают доходы.\n
    3⃣Профицит бюджета: обратная ситуация, когда доходы превышают расходы.\n
    4⃣Сбережения: часть дохода, которая остается после оплаты всех необходимых расходов и может быть использована для накопления или инвестирования.\n
    5⃣Инвестиции: вложение денег в различные активы с целью получения дохода или увеличения стоимости вложений в будущем.\n
    6⃣Кредит: сумма денег, которую заемщик берет у кредитора на определенных условиях (например, с обязательством вернуть деньги с процентами).\n
    7⃣Ставка процента: плата, которую кредитор взимает за предоставление денег в долг.\n
    8⃣Ставка дисконтирования: ставка, по которой будущие доходы от инвестиций приводятся к текущему моменту времени для оценки их стоимости.\n
    9⃣Риск: вероятность того, что инвестиция не принесет ожидаемого дохода или приведет к убыткам.\n
    🔟Ликвидность: способность актива быть быстро проданным по цене, близкой к рыночной.
    """

#config_casino
GAMES = "Игры 💣"
BALANCE = "Ваш баланс 💵"
BALANCE_PAY = "Пополнить баланс 💸"
STOP_GAME = "Остановить игру ❌"
DISCR = "О боте 📱"
HELP = "Помощь 🔍"

DICE_GAME = "Игра в кости 🎲"
GAMES_SLOTS = "Игра в слоты 🎰"
RPS_GAME = "Камень-ножницы-бумага ✂"

ROLL_THE_DICE = "Кинуть кости 🎲"
TWIST = "Крутить слот 🎰"
ROCK = "Камень✊"
PAPER = "Бумага🖐"
SCISSORS = "Ножницы✌"

MAIN_MENU = "Главное меню 🕹"
BACK_TO_GAMES = "Вернуться к списку игр 💣"

HELP_COMMAND = """
<b>/start</b> - <em>Запуск/перезапуск бота</em>
<b>Игры 💣</b> - <em>Меню игр</em>
<b>Ваш баланс 💵</b> - <em>Меню баланса</em>
<b>Помощь 🔍</b> - <em>Все команды</em>
<b>О боте 📱</b> - <em>Описание бота</em>\n
В меню игры вы можете выбрать игру в которую хотите поиграть.
Перед началом каждой игры пишутся правила, которые нужно учитывать.
Приятной игры 👋"""