TOKEN = '6430227260:AAEJ1OK5h3m_EWXodFARn59UmQny_1niat4'

TEXT_FOR_TERM = """
    Терминология:\n
    1⃣Личный бюджет: совокупность всех доходов и расходов за определенный период времени.\n
    2⃣Дефицит бюджета: ситуация, когда расходы превышают доходы.\n
    3⃣Профицит бюджета: обратная ситуация, когда доходы превышают расходы.\n
    4⃣Сбережения: часть дохода, которая остается после оплаты всех необходимых расходов и может быть использована для накопления или инвестирования.\n
    5⃣Инвестиции: вложение денег в различные активы с целью получения дохода или увеличения стоимости вложений в будущем.\n
    6⃣Кредит: сумма денег, которую заемщик берет у кредитора на определенных условиях (например, с обязательством вернуть деньги с процентами).\n
    7⃣Ставка процента: плата, которую кредитор взимает за предоставление денег в долг.\n
    8⃣Ставка дисконтирования: ставка, по которой будущие доходы от инвестиций приводятся к текущему моменту времени для оценки их стоимости.\n
    9⃣Риск: вероятность того, что инвестиция не принесет ожидаемого дохода или приведет к убыткам.\n
    🔟Ликвидность: способность актива быть быстро проданным по цене, близкой к рыночной.
    """
